"use strict";

console.log('number' + 3 + 3); //відбулось перетворення чисел на строку та конкатинація строкі в результаті виводиться number33
console.log(null + 3); // null перетворюється на 0, 0+3 = 3
console.log(5 && "qwerty"); // 5 ==> true, "qwerty" ==> true, в консоль виведеться qwerty, останнє правдиве значення зліва направо
console.log(+'40' + +'2' + "hillel"); // відбувається конкатенація строк і в результаті виводиться 42hillel
console.log('10' - 5 === 6); // Вираз 5 === 6 це невірне значення, тому весь вираз має значення false 
console.log(true + false); //true це 1, false це 0, 1+0 = 1
console.log('4px' - 3); // '4px' це строка, яку не можна привести до числа, тому в консолі виведеться NaN
console.log('4' - 3); // "4" приводиться до 4 і здійснєються арифметична дія, 4-3 = 1
console.log('6' + 3 ** 0); // Будь яке число в 0 степені це 1, відбулась конкатенація строк і в результаті виводиться 61 
console.log(12 / '6'); // При здійсненні арифметичних операцій '6' приводиться до типу данних number, 12/6 = 2
console.log('10' + (5 === 6)); //Вираз 5 === 6 має значення false, тому відбулась конкатинація строк і в результаті виводиться 10false
console.log(null == ''); // null не є строкою, тому вираз приймає значення false
console.log(3 ** (9 / 3)); // Спочатку виконується операція яка є в дужках 9/3 = 3, 3 в 3тій ступені дорівнює 27
console.log(!!'false' == !!'true'); // !!'false' приводиться до true, !!'true' приводиться до true, true == true це true 
console.log(0 || '0' && 1); // 0 є хибним значенням, тому у виразі 0 || '0', вертається '0' тобто true, а далі оскільки обидві умови є вірними, вертається останній правдивий вираз зліва направо, тобто 1
console.log((+null == false) < 1); // (+null == false) ==> true, true = 1, 1<1 ==> false
console.log(false && true || true); // false && true ==> false, false || true ==> true
console.log(false && (false || true)); //  false || true ==> true, false && true ==> false
console.log((+null == false) < 1 ** 5); //(+null == false) ==> true, true = 1, 1**5 дорівнює 1 1<1 ==> false



